{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "FocalLossViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "finetuning_task": "image-classification",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Commercial",
    "1": "Industrial",
    "2": "Institutional",
    "3": "ResidentialAttachedHouses",
    "4": "ResidentialDetachedHouses",
    "5": "ResidentialHighApartments",
    "6": "ResidentialLowApartments",
    "7": "Retail"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Commercial": "0",
    "Industrial": "1",
    "Institutional": "2",
    "ResidentialAttachedHouses": "3",
    "ResidentialDetachedHouses": "4",
    "ResidentialHighApartments": "5",
    "ResidentialLowApartments": "6",
    "Retail": "7"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.29.1"
}
